# Q_1. 다음 코드 실행 후 result 변수에 저장되는 값은?
# A_1. ppl

""" s = 'apple'
result = s[1:4]

print(result) """

# Q_2. 다음 중 딕셔너리 자료형의 정의로 올바른 것은?
# A_2. d)

""" a) {'apple', 'banana', 'cherry'}
b) ['apple', 'banana', 'cherry']
c) ('apple', 'banana', 'cherry')
d) {'name': 'John', 'age': 25} 
"""

# Q_3. 다음 코드의 실행 결과로 올바른 값을 작성하시오.
# A_3. b)

""" x = 'Hello'
print(x[::-1]) """

""" a) Hello
b) olleH
c) hELLO
d) 없음 """

# Q_4. set(세트)의 특징으로 옳은 것을 고르시오.
# A_4. d)

""" a) 순서가 있다
b) 중복된 값을 허용한다
c) 키-값 쌍으로 구성된다
d) 중복을 허용하지 않는다 """

# Q_5. 다음 코드 실행 결과로 옳은 것을 고르시오.
# A_5. b)

""" my_dict = {'a': 1, 'b': 2}
my_dict['a'] = 3 """

""" a) {'a': 1, 'b': 2}
b) {'a': 3, 'b': 2} 
c) {'a': 3, 'b': 3}
d) {b': 2}
"""

# Q_6. 다음 중 파이썬의 컬렉션 타입이 아닌 것은?
# A_6. c)

""" a) list
b) dict
c) int
d) set """

# Q_7. 다음 중 튜플의 특징으로 옳은 것을 고르시오.
# A_7. c)

""" a) 요소를 수정할 수 있다
b) 요소를 추가할 수 있다
c) 요소의 순서가 유지된다
d) 중복된 값을 허용하지 않는다 """

# Q_8. 다음 중 range(2, 10, 2)의 결과로 올바른 것을 고르시오.
# A_8. b)

""" a) [2, 3, 4, 5, 6, 7, 8, 9]
b) [2, 4, 6, 8]
c) [2, 5, 8]
d) [2, 4, 6, 8, 10]"""

# Q_9. 다음 코드의 결과로 올바른 것을 고르시오.
# A_9. b)

""" x = 0
print(x or 5) """

""" a) 0
b) 5
c) True
d) None """

# Q_10. 다음 중 비교 연산의 결과가 True가 되는 것은?
# A_10. c)

""" a) 3 == '3'
b) 5 > 10
c) 7 <= 7
d) 4 != 4 """